# 유사 세그먼트자나~
# 세그먼트 업데이트 쓰는 느낌인데
# 세그먼트는 이진트리인데 이건 아니네 ㅎ
# 아~ 뭔 트리가 가지가 5개나 되냐고~
# 뭐 고런 너낌?
# 그럼 가지 수 전부 해서 sum한 게 현재 노드의 전력량이니까
# 1. 리프노드의 전력량부터 맞춘다.
# 2. 상위 트리를 확인한다.
# 3. 상위 트리의 전력량이 초과한다면, 자식+본인이 가지고 있는 전자제품의 양을 확인한다.
# 그래서 뺄만큼 뺀다.
# 이거 반복한다.

# 아~ 복사붙여넣기가 안된대~

# 추가적으로 생각해보면
# 위상정렬이랑 비슷한 느낌으로 풀 수도 있을 것 같음
# 자기랑 이어진 게 없는 것 먼저 해서 촥촥촥 확인하기
# 그런 뒤에 다음거 촥촥촥 확인하기
# 뭐 이런느낌 아닐까?
# 그럼 필요한 것
# 이어진 것 리스트 [0]*(N+1)
# 이어진 게 없을 때 리스트 순회
# 각 콘센트의 무게 계산해야 할 거 같은데 ㅎ
# 재귀로 해야하나?
#


# 위상정렬로 딱 자신에게 맞는 만큼만 없애는건
# 사실상 틀린방법임
# 상위 노드 확인하면서, 하나라도 충족이 안됐으면
# 하위 노드의 전자제품 코드는 다 빼는 게 맞음
# 근데 생각해보니, 하나의 자식일 수 밖에 없네,,,?
# 괜히 고민했네?


k = 300
limits = [2000,1000,3000,200,600,500]
N = len(limits)
sockets = [[2,3,-1,-1,-1],[4,0,-1,-1,6],[5,0,0,0,0],[-1,0,0,0,0],[-1,-1,-1,-1,-1],[-1,-1,0,0,0]]
