# 동전1 아이디어 정리

# K와 동전리스트가 주어진다.
# for문을 돌려서 K를 동전으로 나눈 몫을 본다.
# ( 나머지도 쓰나? )
# 어떤 아이디어.
# a,b가 나오잖아
# b가 0이 아니면, 다음 코인에서 b 반복하면
# 몫이 나오나?

# 1 2 5 일때

# 5 : 2
# 2 : 5
# 1 : 10
# 인데
# 5를 2개 쓸 때
# 5를 1개 쓸 때
# 5를 0개 쓸 때
# 3 가지 경우로 나뉘고
# 그 안에서 다시

# 5 = 2
# 1) 5를 2개 쓰고 끝

# 5 = 1
# 1 ) 2를 2개 쓸 때
# 2 ) 2를 1개 쓸 때
# 3 ) 2를 0개 쓸 때

# 5 = 0
# 2를 5개 쓸 때
# 2를 4개 쓸 때
# 2를 3개 쓸 때
# 2를 2개 쓸 때
# 2를 1개 쓸 때
# 2를 0개 쓸 때
# 이렇게 나뉘는 거.

N, M = map(int, input().split())
coins = [int(input) for i in range(N)]
DP = [0] * (M+1)
# DP[i] 를 구하는 규칙을 찾아보자.
# 1로 채울 수 있는 경우의 수 = 1개
# 2일 때는, 11 과 2 로 2개
# 3일 때는, 111 과 2 1 로 2개. ? 맞나? 맞다. (순열 X 조합임)
# 4일 때는 1111과 22와 112로 3개. 지금까지 1, 2, 2, 3
# 5일 때는 11111과 122와 1112와 5로 4개. 지금까지 1 2 2 3 4